// Q. 주어진 양식에 따라 구구단 작성
/*
 2 3 4 
 -----
 단들

 5 6 7
 -----
 단들

 8 9
 -----
 단들
*/
#include<stdio.h>

int main()
{
	printf("구구단 출력\n");
	for (int k = 0; k < 3; k++) // 행 출력(3/3/2)
	{
		if (k == 2)	// 8단, 9단의 경우 10 제외
		{
			printf("%d\t\t%d\t\t\n", 3 * k + 2, 3 * k + 3);
			printf("----------------------------\n");
		}
		else // 2~4단, 5~7단 출력
		{
			printf("%d\t\t%d\t\t%d\n", 3 * k + 2, 3 * k + 3, 3 * k + 4);
			printf("---------------------------------------------\n");
		}
		
		/*
		-------------------------
		가로로 출력
		j * i = i*j
		-------------------------
		*/

		for (int i = 1; i <= 9; i++)	// 구구단 계산 및 출력
		{
			for (int j = 3*k+2; j <= 3*k+4; j++)
			{
				if (j >= 10)
				{
					break;
				}
				else
				{
					printf("%d * %d = %2d\t", j, i, i*j);
				}
			}
			puts("");	// 가로 개행

		}
		puts("");	// 세로 개행
	}

	return 0;
}